cf/Documents/УстановкаМинимальногоОстатка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаМинимальногоОстатка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МинимальныеОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрСклады</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемыйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/InformationRegisters/МинимальныеОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МинимальныеОстаткиНаСкладе</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекомендуемыйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Documents/УстановкаМинимальногоОстатка/Ext/ObjectModule.bsl
Функция ПолучитьТаблицуТоваров()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НомерСтроки,
	|	Номенклатура КАК Товар,
	|	МинимальныйОстаток,
	|	Склад,
	|	Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.УстановкаМинимальногоОстатка.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДвиженияПоРегистрам(СтруктураШапки, ТаблицаТоваров, РежимПроведения, Отказ, Заголовок)
	
	// ТОВАРЫ НА СКЛАДАХ
	
	Таблица = Движения.МинимальныеОстаткиНаСкладе.Выгрузить();
	Таблица.Очистить();
	
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		НовСтрока = Таблица.Добавить();
		НовСтрока.Регистратор = Ссылка;
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТоваров);
		
		НовСтрока.Активность = Истина;
		
	КонецЦИкла;
	
	Движения.МинимальныеОстаткиНаСкладе.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Заголовок = "Проведение документа " + Ссылка;
	//
	////СтруктураШапки	= ПолучитьСтруктуруШапки();
	//ТаблицаТоваров 	= ПолучитьТаблицуТоваров();
	//
	//Если НЕ Отказ Тогда
	//	ДвиженияПоРегистрам(Новый Структура, ТаблицаТоваров, РежимПроведения, Отказ, Заголовок);
	//КонецЕсли;

	Движения.МинимальныеОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.МинимальныеОстаткиНаСкладе.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = ТекСтрокаТовары.Склад;
		Движение.МинимальныйОстаток 	= ТекСтрокаТовары.МинимальныйОстаток;
		Движение.РекомендуемыйОстаток 	= ТекСтрокаТовары.РекомендуемыйОстаток; КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ид = ПроверяемыеРеквизиты.Найти("Склад");
	Если Ид <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Ид); КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтрСклады = "";
	текСклады = Новый Соответствие;
	
	Для Каждого Строка Из Товары Цикл Если текСклады[Строка.Склад] = Неопределено Тогда текСклады.Вставить(Строка.Склад, Истина); СтрСклады = СтрСклады + ?(СтрСклады = "", "", ",") + Строка(строка.Склад); КонецЕсли; КонецЦикла;
	
КонецПроцедуры
